{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "parameters": [
          {
            "id": "2249067d-2355-489a-a697-f256d9a10949",
            "version": "KqlParameterItem/1.0",
            "name": "CurrentVersion",
            "type": 1,
            "isHiddenWhenLocked": true,
            "timeContext": {
              "durationMs": 86400000
            },
            "value": "1.1"
          },
          {
            "id": "188cd3de-25f2-4c92-974f-efbc03908749",
            "version": "KqlParameterItem/1.0",
            "name": "UpdateAvailable",
            "type": 1,
            "query": "externaldata (\r\n    Workbook:string,\r\n    Version:string,\r\n    URL:string\r\n    ) \r\n[h\"https://raw.githubusercontent.com/GrzesB/Sentinel/master/.version/version_info.csv\"] \r\nwith (ignoreFirstRecord=true)\r\n| where Workbook == \"sentinel_cost\"\r\n| project Status = iff(toreal(Version) > toreal({CurrentVersion}), \"True\", \"False\")",
            "isHiddenWhenLocked": true,
            "timeContext": {
              "durationMs": 86400000
            },
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces"
          },
          {
            "id": "3ebcf4a4-a1de-4fc7-b94a-014a4ff323d4",
            "version": "KqlParameterItem/1.0",
            "name": "URL",
            "type": 1,
            "query": "externaldata (\r\n    Workbook:string,\r\n    Version:string,\r\n    URL:string\r\n    ) \r\n[h\"https://raw.githubusercontent.com/GrzesB/Sentinel/master/.version/version_info.csv\"] \r\nwith (ignoreFirstRecord=true)\r\n| where Workbook == \"sentinel_cost\"\r\n| project URL",
            "isHiddenWhenLocked": true,
            "timeContext": {
              "durationMs": 86400000
            },
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces"
          }
        ],
        "style": "pills",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "parameters - 16"
    },
    {
      "type": 1,
      "content": {
        "json": "## Estimated Sentinel cost\n---\nver. {CurrentVersion}"
      },
      "name": "text - 2"
    },
    {
      "type": 1,
      "content": {
        "json": "New version of the workbook is available at the following link: {URL}",
        "style": "info"
      },
      "conditionalVisibility": {
        "parameterName": "UpdateAvailable",
        "comparison": "isEqualTo",
        "value": "True"
      },
      "name": "text - 17",
      "styleSettings": {
        "showBorder": true
      }
    },
    {
      "type": 1,
      "content": {
        "json": "No discounts are taken into the consideration. This is an estimated cost based on regular price specified below.",
        "style": "warning"
      },
      "name": "text - 2 - Copy"
    },
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "parameters": [
          {
            "id": "0399b1a0-1ef2-4a39-815d-656ae757fab2",
            "version": "KqlParameterItem/1.0",
            "name": "TimeRange",
            "label": " Time Range",
            "type": 4,
            "isRequired": true,
            "value": {
              "durationMs": 2592000000
            },
            "typeSettings": {
              "selectableValues": [
                {
                  "durationMs": 3600000
                },
                {
                  "durationMs": 86400000
                },
                {
                  "durationMs": 172800000
                },
                {
                  "durationMs": 604800000
                },
                {
                  "durationMs": 2592000000
                },
                {
                  "durationMs": 5184000000
                },
                {
                  "durationMs": 7776000000
                }
              ],
              "allowCustom": true
            },
            "timeContext": {
              "durationMs": 86400000
            }
          },
          {
            "id": "f2b4d460-2868-4cc6-958b-975b092f2654",
            "version": "KqlParameterItem/1.0",
            "name": "Price",
            "type": 1,
            "description": "Price per GB (Sentinel + Log Analytics).",
            "value": "4.71",
            "timeContext": {
              "durationMs": 86400000
            }
          }
        ],
        "style": "pills",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "customWidth": "40",
      "name": "parameters - 2"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "union *\r\n| where TimeGenerated {TimeRange:query}\r\n| summarize Total = round((sumif(_BilledSize, _IsBillable==true) / 1000000000) * {Price}, 2)\r\n",
        "size": 4,
        "title": "Sentinel total cost",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "card",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "total",
              "formatter": 0,
              "numberFormat": {
                "unit": 0,
                "options": {
                  "style": "decimal",
                  "useGrouping": true,
                  "maximumFractionDigits": 2
                }
              }
            }
          ]
        },
        "textSettings": {
          "style": "bignumber"
        }
      },
      "customWidth": "30",
      "name": "query - 3"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "union *\r\n| where TimeGenerated {TimeRange:query}\r\n| summarize Size = format_bytes(sumif(_BilledSize, _IsBillable==true))",
        "size": 4,
        "title": "Ingested data",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "card",
        "textSettings": {
          "style": "bignumber"
        }
      },
      "customWidth": "30",
      "name": "query - 6"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "search * \r\n| where TimeGenerated between({TimeRange:start} .. {TimeRange:end})\r\n| where not(Type == 'SecurityAlert' and (ProviderName == 'ASI Scheduled Alerts' or ProviderName == 'CustomAlertRule')) \r\n| summarize Count=count() by Type, bin_at(TimeGenerated, 1h , now()), Computer\r\n| render columnchart ",
        "size": 1,
        "title": "Amount of events by group type",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "query - 4"
    },
    {
      "type": 1,
      "content": {
        "json": ""
      },
      "name": "text - 11",
      "styleSettings": {
        "showBorder": true
      }
    },
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "parameters": [
          {
            "id": "1b7bdf16-3568-4acb-a30d-d1d40da3dbf5",
            "version": "KqlParameterItem/1.0",
            "name": "ReferenceLine",
            "label": "Reference line value [GB]",
            "type": 1,
            "description": "Enter number to draw a reference line.",
            "isRequired": true,
            "value": "0.3",
            "timeContext": {
              "durationMs": 86400000
            }
          }
        ],
        "style": "pills",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "parameters - 10"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "union *\r\n| where TimeGenerated {TimeRange:query}\r\n| summarize ['Size [GB]'] = sumif(_BilledSize, _IsBillable==true)/1000000000 by bin(TimeGenerated, 1d)",
        "size": 1,
        "aggregation": 3,
        "title": "Daily data ingestion [GB]",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "barchart",
        "chartSettings": {
          "customThresholdLine": "{ReferenceLine}",
          "customThresholdLineStyle": 2
        }
      },
      "name": "query - 9"
    },
    {
      "type": 1,
      "content": {
        "json": ""
      },
      "name": "text - 12",
      "styleSettings": {
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "union withsource=TableName1 *\n| where TimeGenerated {TimeRange:query}\n| summarize Entries = count(), Size = sum(_BilledSize), last_log = datetime_diff(\"second\",now(), max(TimeGenerated)), estimate  = sumif(_BilledSize, _IsBillable==true)  by TableName1, _IsBillable\n| project ['Table Name'] = TableName1, ['Table Size'] = Size, ['Table Entries'] = Entries,\n          ['Size per Entry'] = 1.0 * Size / Entries, ['IsBillable'] = _IsBillable, ['Last Record Received'] = last_log, ['Estimated Table Price'] =  (estimate/(1000*1000*1000)) * {Price}\n | order by ['Table Size']  desc\n\n ",
        "size": 3,
        "showAnalytics": true,
        "title": "Data per table",
        "exportFieldName": "Table Name",
        "exportParameterName": "TableName",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "Table Name",
              "formatter": 0,
              "tooltipFormat": {
                "tooltip": "Click on table name to display additional details."
              }
            },
            {
              "columnMatch": "Table Size",
              "formatter": 3,
              "formatOptions": {
                "palette": "yellowOrangeBrown"
              },
              "numberFormat": {
                "unit": 36,
                "options": {
                  "style": "decimal",
                  "useGrouping": true,
                  "minimumFractionDigits": 2,
                  "maximumFractionDigits": 2
                }
              }
            },
            {
              "columnMatch": "Table Entries",
              "formatter": 0,
              "numberFormat": {
                "unit": 0,
                "options": {
                  "style": "decimal",
                  "useGrouping": true
                }
              }
            },
            {
              "columnMatch": "Size per Entry",
              "formatter": 0,
              "numberFormat": {
                "unit": 0,
                "options": {
                  "style": "decimal",
                  "useGrouping": true
                }
              }
            },
            {
              "columnMatch": "IsBillable",
              "formatter": 18,
              "formatOptions": {
                "thresholdsOptions": "colors",
                "thresholdsGrid": [
                  {
                    "operator": "==",
                    "thresholdValue": "True",
                    "representation": "redBright",
                    "text": "{0}{1}"
                  },
                  {
                    "operator": "==",
                    "thresholdValue": "False",
                    "representation": "green",
                    "text": "{0}{1}"
                  },
                  {
                    "operator": "Default",
                    "thresholdValue": null,
                    "representation": "blue",
                    "text": "{0}{1}"
                  }
                ]
              }
            },
            {
              "columnMatch": "Last Record Received",
              "formatter": 0,
              "numberFormat": {
                "unit": 24,
                "options": {
                  "style": "decimal",
                  "maximumFractionDigits": 2
                }
              }
            },
            {
              "columnMatch": "Estimated Table Price",
              "formatter": 0,
              "numberFormat": {
                "unit": 0,
                "options": {
                  "style": "decimal",
                  "useGrouping": true,
                  "maximumFractionDigits": 2
                }
              }
            }
          ],
          "labelSettings": [
            {
              "columnId": "Table Size",
              "label": "Table Size"
            },
            {
              "columnId": "Size per Entry",
              "label": "Size per Entry [bytes]"
            },
            {
              "columnId": "Last Record Received",
              "label": "Last Record Received (ago)"
            }
          ]
        }
      },
      "customWidth": "100",
      "name": "query - 2",
      "styleSettings": {
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "{TableName}\r\n| where TimeGenerated {TimeRange:value}\r\n| summarize IngestedMBytes = sum(_BilledSize)/1000/1000 by bin(TimeGenerated, 1d)",
        "size": 0,
        "title": "Amount of ingested MBytes for {TableName}",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "barchart"
      },
      "customWidth": "40",
      "name": "query - 5",
      "styleSettings": {
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityEvent\r\n| where TimeGenerated {TimeRange}\r\n| summarize Entries = count(), Size = format_bytes(sum(_BilledSize)), SizeBytes = sum(_BilledSize) by Activity\r\n| join (\r\n    SecurityEvent\r\n    | where TimeGenerated {TimeRange}\r\n    | summarize EntriesByComp = count() by Activity, Computer\r\n    | summarize arg_max(EntriesByComp, *) by Activity\r\n)\r\non Activity\r\n| order by SizeBytes desc\r\n| project Activity, Entries, Size, [\"Top Computer\"] = Computer, [\"Ent. by Top Comp.\"] = EntriesByComp\r\n| take 10",
        "size": 0,
        "title": "Top 10 events from SecurityEvents table",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "Entries",
              "formatter": 0,
              "numberFormat": {
                "unit": 0,
                "options": {
                  "style": "decimal",
                  "useGrouping": true
                }
              }
            },
            {
              "columnMatch": "Ent. by Top Comp.",
              "formatter": 0,
              "formatOptions": {
                "customColumnWidthSetting": "5%"
              },
              "numberFormat": {
                "unit": 0,
                "options": {
                  "style": "decimal",
                  "useGrouping": true
                }
              }
            }
          ],
          "labelSettings": [
            {
              "columnId": "Activity",
              "label": "Event ID"
            },
            {
              "columnId": "Entries",
              "label": "No. of Entries"
            },
            {
              "columnId": "Size",
              "label": "Size"
            }
          ]
        }
      },
      "conditionalVisibility": {
        "parameterName": "TableName",
        "comparison": "isEqualTo",
        "value": "SecurityEvent"
      },
      "customWidth": "60",
      "name": "query - 7",
      "styleSettings": {
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "CommonSecurityLog\r\n| where TimeGenerated {TimeRange}\r\n| summarize \r\n    Entries = count(), \r\n    BilledSize = sum(_BilledSize) by DeviceVendor\r\n| extend ['Estimated Price'] = round((BilledSize / (1000 * 1000 * 1000)) * {Price}, 2)\r\n| extend Size = format_bytes(BilledSize)\r\n| project DeviceVendor, Entries, Size, ['Estimated Price']\r\n| order by Size desc \r\n| take 10\r\n",
        "size": 0,
        "title": "CustomSecurityLog - Top 10 vendors",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "conditionalVisibility": {
        "parameterName": "TableName",
        "comparison": "isEqualTo",
        "value": "CommonSecurityLog"
      },
      "customWidth": "50",
      "name": "query - 8",
      "styleSettings": {
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "DnsEvents\r\n| where TimeGenerated {TimeRange}\r\n| where SubType == \"LookupQuery\"\r\n| summarize Entries = count(), Size = format_bytes(sum(_BilledSize)), SizeBytes = sum(_BilledSize) by Name\r\n| join (\r\n    DnsEvents\r\n    | where TimeGenerated {TimeRange}\r\n    | where SubType == \"LookupQuery\"\r\n    | summarize Queries = count() by Name, ClientIP\r\n    | summarize arg_max(Queries, *) by Name\r\n    )\r\n    on Name\r\n| order by SizeBytes desc \r\n| project Name, Entries, Size, [\"Top Client\"] = ClientIP, [\"Ent. by Top Client\"] = Queries \r\n| take 10",
        "size": 0,
        "title": "Top 10 events from DnsEvents table",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "Entries",
              "formatter": 0,
              "numberFormat": {
                "unit": 0,
                "options": {
                  "style": "decimal",
                  "useGrouping": true
                }
              }
            },
            {
              "columnMatch": "Size",
              "formatter": 0,
              "numberFormat": {
                "unit": 4,
                "options": {
                  "style": "decimal"
                }
              }
            },
            {
              "columnMatch": "Ent. by Top Client",
              "formatter": 0,
              "formatOptions": {
                "customColumnWidthSetting": "20%"
              },
              "numberFormat": {
                "unit": 0,
                "options": {
                  "style": "decimal",
                  "useGrouping": true
                }
              }
            },
            {
              "columnMatch": "Queries by Contributor",
              "formatter": 0,
              "formatOptions": {
                "customColumnWidthSetting": "20%"
              },
              "numberFormat": {
                "unit": 0,
                "options": {
                  "style": "decimal",
                  "useGrouping": true
                }
              }
            }
          ],
          "labelSettings": [
            {
              "columnId": "Name",
              "label": "DNS Record"
            }
          ]
        }
      },
      "conditionalVisibility": {
        "parameterName": "TableName",
        "comparison": "isEqualTo",
        "value": "DnsEvents"
      },
      "customWidth": "60",
      "name": "query - 13",
      "styleSettings": {
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\r\n| where TimeGenerated {TimeRange}\r\n| summarize Entries = count(), Size = format_bytes(sum(_BilledSize)), SizeBytes = sum(_BilledSize) by ResultType\r\n| join (\r\n    SigninLogs\r\n    | where TimeGenerated {TimeRange}\r\n    | summarize EntriesByIP = count() by ResultType, IPAddress\r\n    | summarize arg_max(EntriesByIP, *) by ResultType\r\n)\r\non ResultType\r\n| order by SizeBytes desc\r\n| extend ResultDescription = iif(ResultType in (\"0\", \"50125\", \"50140\"), \"Success\", \"Failure\")\r\n| project ResultType, ResultDescription, Entries, Size, [\"Top IP\"] = IPAddress, [\"Ent. by Top IP.\"] = EntriesByIP\r\n| take 10",
        "size": 0,
        "showAnalytics": true,
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "conditionalVisibility": {
        "parameterName": "TableName",
        "comparison": "isEqualTo",
        "value": "SigninLogs"
      },
      "customWidth": "60",
      "name": "query - 15",
      "styleSettings": {
        "showBorder": true
      }
    }
  ],
  "fromTemplateId": "sentinel-UserWorkbook",
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}